Revit 2024 API
CompoundStructure.GetLayers Method
 A copy of the layers which define this compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IList<CompoundStructureLayer> GetLayers()
Visual Basic
Public Function GetLayers As IList(Of CompoundStructureLayer)
Visual C++
public:
IList<CompoundStructureLayer^>^ GetLayers()
Return Value
 The layers, returned in order (Exterior to Interior for walls, top to bottom for roofs, floors or ceilings). The index of each layer in this array can be used in other CompoundStructure methods accepting a layer index.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace